n = int(input())
import sys
# 1.Създайте две помощни променливи:"max_num" с много ниска първоначална стойност, в която да пазите най-голямото от прочетените числа;"sum" с първоначална стойност 0, в която да пазите сумата от прочетените числа:
sum_numbers = 0
max_num = -sys.maxsize
# 2.Прочетете броя числа, които ще се въведат на конзолата – n, и направете for цикъл от 0 до n, като на всяко завъртане четете число num:
for i in range (n) :
    num = int(input())
#3.Вътре в цикъла направете проверка дали прочетеното число е по-голямо от "max_num". Ако е по-голямо, приравнете стойността на "max_num" към неговата. След което добавете стойността на прочетеното число към "sum_numbers":
    if num > max_num :
        max_num = num
    #извън if сумирайте:
    sum_numbers += num
#4.След цикъла проверете дали "max_num" е равно на сумата от всички числа, от която е извадено "max_num":
if max_num == sum_numbers - max_num :
    print ("Yes")
    print (f"Sum = {max_num}")
# 5.Разликата между най-голямото число и сумата от останалите:
else :
    print ("No")
    sum_others = sum_numbers - max_num
    print (f"Diff = {abs(sum_others - max_num)}")